# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'git'
# brew 'ansible'
# brew 'awscli'
brew 'heroku-toolbelt'
brew 'mackup' # Saves application preferences to dropbox
# brew 'mas' # Mac app store
brew 'scmpuff'
brew 'node'
brew 'vim'
brew 'wget'

# Apps
# cask 'adobe-creative-cloud'
# cask 'adobe-photoshop-cc'
# cask 'adobe-photoshop-lightroom'
# cask 'aerial'
cask 'caffeine'
# cask 'citrix-receiver'
# cask 'docker'
cask 'dropbox'
cask 'fluid'
cask 'firefox'
cask 'google-chrome'
# cask 'google-hangouts'
cask 'iterm2'
cask 'lastpass'
cask 'postman'
cask 'product-hunt'
# cask 'sequel-pro'
cask 'slack'
cask 'spectacle'
cask 'spotify'
# cask 'transmit'
# cask 'vagrant'
# cask 'viscosity' #vpn
cask 'visual-studio-code'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
# cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-inconsolata'
cask 'font-source-code-pro'

# Install Mac App Store apps
# mas 'Microsoft Remote Desktop', id: 715768417
# mas 'Pocket', id: 568494494
